---

C#Visual BasicVisual C++

Revit 2024 API
---
Definitions..::..Create Method
Definitions Class See Also Send Feedback
---

Creates a new parameter definition using specified options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015

# Syntax

C#
---

    public Definition Create(
    	ExternalDefinitionCreationOptions option
    )

Visual Basic
---

    Public Function Create ( _
    	option As ExternalDefinitionCreationOptions _
    ) As Definition

Visual C++
---

    public:
    Definition^ Create(
    	ExternalDefinitionCreationOptions^ option
    )

#### Parameters

option
    Type: Autodesk.Revit.DB..::..ExternalDefinitionCreationOptionsThe options used to create the new parameter definition.

#### Return Value

If successful a reference to the new parameter definition is returned, otherwise nullNothingnullptra null reference (Nothing in Visual Basic).

# Remarks

This method only supports creation of new external definitions (shared parameters).

# See Also

Definitions Class

Autodesk.Revit.DB Namespace